app/controllers/products_controller.rb

  def change_curreny
    file_data = Product.get_currency_data_arry
    products = Product.all
    if params["type"] != "EUR"
      @products = []
      selected_currency_price = Product.get_selected_currency_price(params["type"], file_data)
      products.each do |product|
---
SELECT "products".* FROM "products"